# PointElementMirrored Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PointElementMirrored Property
ParameterTypeId Class See Also
---
"Mirrored"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PointElementMirrored { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointElementMirrored As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PointElementMirrored {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace